{
	"greeting": "Hello! AI Development Partner, ^Caret.",
	"catchPhrase": "",
	"bannerAlt": "Caret Main Banner",

	"geminiOffer": {
		"header": "✨ Google Gemini Special Launch Offer!",
		"body": "Experience the world of AI coding with the powerful Google Gemini model! New GCP users who sign up and get a Gemini API key will receive <strong>$300 in free credits valid for 3 months</strong>. Don't miss this special opportunity! (Details: <vscode-link href=\"https://blog.naver.com/fstory97/223887376667\">here</vscode-link>)"
	},

	"coreFeatures": {
		"header": "Start 'Vibe Coding' with Caret, the AI coding agent that grows with you.",
		"description": "Multi-language support, developer-led AI orchestration, customizable workflows, transparent AI control, and powerful local LLM integration. Beyond simple conversations, Caret proposes a 'Vibe Coding' development culture where you systematically create documents with AI and grow together based on those records."
	},

	"modelFlexibility": {
		"header": "Choose your model freely, unlimited possibilities",
		"body": "Caret is not tied to specific vendors. <strong>Easily connect your own local sLLM through Ollama</strong> or use various external API keys you're already using like Anthropic Claude, OpenAI, and more. Choose the optimal AI for your project and style."
	},

	"caretAccount": {
		"header": "Coming Soon! Caret Integrated Subscription Service (Monthly)",
		"body": "No more complex API key setup! With the upcoming Caret integrated account (monthly subscription), you'll be able to use carefully selected high-performance AI agents including Google Gemini right away. Be the first to get the latest news!"
	},

	"educationOffer": {
		"header": "✨ Start Now! Free 'Vibe Coding' Education & Google Gemini $300 Credit Tips!",
		"body": "Join our <strong>open-source education program</strong> to learn real 'Vibe Coding' with Caret and experience the full AI blogger agent development process! This program is provided for free and offers warm guidance and a rich practice environment needed to take your first real steps in AI development. We also provide <strong>$300 GCP credit utilization tips for 3 months</strong> for those using Google Gemini API for the first time. Experience the joy of AI development without cost burden! (Education program and Gemini credit tips <VSCodeLink href=\"{{educationLink}}\">Learn more</VSCodeLink>)"
	},

	"getStarted": {
		"header": "",
		"body": "",
		"button": "Get Started",
		"preferredLanguage": "AI Response Language",
		"uiLanguage": "Interface Language"
	},

	"personaSelector": {
		"header": "🎭 Choose Your AI Agent Persona",
		"description": "Select the personality of your AI agent companion. Each persona has unique communication styles and expertise.",
		"selectButton": "Select"
	},

	"community": {
		"header": "🌱 Join Our Community",
		"body": "Connect with other developers using Caret! As an open-source project, Caret grows through your participation in our GitHub repository - report issues, suggest features, and help us evolve together.<br/><br/>💻 <strong>Code Contribution</strong>, 🐛 <strong>Bug Reports</strong>, 💡 <strong>Ideas & Suggestions</strong>, 💰 <strong>Financial Support</strong>, 📖 <strong>Documentation</strong> - there are many ways to participate!<br/><br/>🎁 <strong>Contributor Benefits</strong>: Service credits, GitHub recognition, website listing, priority access to new features",
		"githubLink": "GitHub Repository"
	},

	"apiSetup": {
		"backButton": "← Back",
		"title": "🔧 API Setup",
		"description": "Set up your AI API to use Caret.",
		"instructions": "Subscribe to Caret or set up API keys for OpenAI, Anthropic, or other AI services, or configure local LLM.",
		"saveButton": "Save and Get Started",
		"help": {
			"title": "Need Help?",
			"button": "View Documentation"
		}
	},

	"footer": {
		"links": {
			"caretGithub": "Caret GitHub",
			"basedOnCline": "Based on Cline",
			"caretService": "Caret Service",
			"caretiveInc": "Caretive Inc",
			"about": "About",
			"terms": "Terms of Service",
			"privacy": "Privacy Policy",
			"youthProtection": "Youth Protection Policy",
			"support": "Support"
		},
		"company": {
			"name": "Caretive INC",
			"businessNumber": "Business Registration: 459-81-03703",
			"address": "4F 409-681, 823 Dongtan Sunhwan-daero, Hwaseong-si, Gyeonggi-do, South Korea (Yeongcheon-dong, A-PLEX City)"
		},
		"copyright": {
			"text": "© 2025 Caretive INC. All rights reserved.",
			"builtWith": "Built with ❤️ by Caret Team",
			"version": "Caret v1.0.0"
		}
	}
}
